Revit 2027 API
FabricationConfiguration.GetFabricationConnectorShape Method
 Gets the fabrication connector shape from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorProfileType GetFabricationConnectorShape(
	int fabricationConnectorId
)
Public Function GetFabricationConnectorShape (
	fabricationConnectorId As Integer
) As ConnectorProfileType
public:
ConnectorProfileType GetFabricationConnectorShape(
	int fabricationConnectorId
)
member GetFabricationConnectorShape :
        fabricationConnectorId : int -> ConnectorProfileType
Parameters
fabricationConnectorId Int32
 The fabrication connector identifier.
Return Value
ConnectorProfileType
 The fabrication connector's shape.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace